In [3]:
import pandas as pd

In [4]:
s = pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
s.dtype

dtype('int64')

In [8]:
s.values

array([10, 20, 30, 40])

In [10]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
print(s.name)

numbers

In [14]:
s.name = "numbers"

In [16]:
print(s.name)

numbers

In [19]:
# Indexing 

s[0]
s[0:2]

0    10
1    20
Name: numbers, dtype: int64

In [20]:
# iloc => Location based indexing 

s.iloc[3]

np.int64(40)

In [24]:
s.iloc[[0,1,2,3]]

0    10
1    20
2    30
3    40
Name: numbers, dtype: int64

In [28]:
# Change the indices
fruits = ["Apple","Banana","Pinapple","Mango"]
s.index = fruits
s

Apple       10
Banana      20
Pinapple    30
Mango       40
Name: Fruits, dtype: int64

In [29]:
s["Apple"]

np.int64(10)

In [30]:
s.loc["Apple"] # Label based indexing

np.int64(10)

In [52]:
# Conditional Selections

# s>1 # Reurns True
s[s>10] # filter data y conditionals

1    20
2    30
3    40
dtype: int64

In [54]:
# Logical Operators and or not
s[(s>0) & (s<30)]

0    10
1    20
dtype: int64

In [56]:
# Modifying the series:
s["Mango"] = 2
s

0        10
1        20
2        30
3        40
Mango     2
dtype: int64

In [108]:
# Data Frames :

data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Alice"],
    "age": [25, 30, 35, None, 25],
    "city": ["New York", "Paris", "Paris", "London", "New York"]
}

df = pd.DataFrame(data)
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4    Alice  25.0  New York

In [72]:
df.head()

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4      Eva  28.0      None

In [61]:
df.tail()

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4      Eva  28.0      None

In [66]:
# Drop columns
df.drop("age", axis = 1)

      name      city
0    Alice  New York
1      Bob     Paris
2  Charlie     Paris
3    David    London
4      Eva      None

In [67]:
#check shape
df.shape

(5, 3)

In [74]:
# df.dtype()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [7]:
df.describe()

             age
count   4.000000
mean   29.500000
std     4.203173
min    25.000000
25%    27.250000
50%    29.000000
75%    31.250000
max    35.000000

In [9]:
# Broadcasting 

df['age'] = df['age'] + 20
df

      name   age      city
0    Alice  65.0  New York
1      Bob  70.0     Paris
2  Charlie  75.0     Paris
3    David   NaN    London
4      Eva  68.0      None

In [12]:
# Renaming columns 

df.rename(columns = {"salert": 'salery'}, inplace = True)
df

      name  salery      city
0    Alice    65.0  New York
1      Bob    70.0     Paris
2  Charlie    75.0     Paris
3    David     NaN    London
4      Eva    68.0      None

In [13]:
# unique values

df['salery'].unique()

array([65., 70., 75., nan, 68.])

In [14]:
# count values

df['city'].value_counts()

city
Paris       2
New York    1
London      1
Name: count, dtype: int64

In [16]:
# creating new column
df["Promoted Salery"] = df["salery"] + 2000
df

      name  salery      city  Promoted Salery
0    Alice    65.0  New York           2065.0
1      Bob    70.0     Paris           2070.0
2  Charlie    75.0     Paris           2075.0
3    David     NaN    London              NaN
4      Eva    68.0      None           2068.0

In [18]:
# ---- Data cleaning : ---- 

df.isnull().sum() # check number of null values

name               0
salery             1
city               1
Promoted Salery    1
dtype: int64

In [22]:
df.dropna() # this drop all null values note: without any papametor
df.dropna(how = "any") # any row that had any null value
df.dropna(how = "all") # if all rows has null value then drop otherwise not

      name  salery      city  Promoted Salery
0    Alice    65.0  New York           2065.0
1      Bob    70.0     Paris           2070.0
2  Charlie    75.0     Paris           2075.0

In [32]:
df.fillna(0) # fill null value with 0
df['salery'].fillna(df['salery'].mean()) # filling null salery value into mean
df['city'].fillna("Uknown") # replace all null values of citu into unkown

0    New York
1       Paris
2       Paris
3      London
4      Uknown
Name: city, dtype: object

In [34]:
df["salery"].fillna(df["salery"].median()) # more mathmatically correct

0    65.0
1    70.0
2    75.0
3    69.5
4    68.0
Name: salery, dtype: float64

In [39]:
# forward fill and backward fill

df["salery"].ffill()
df["salery"].bfill()
# but these will gave errors or problums if first or last value is null

0    65.0
1    70.0
2    75.0
3    69.5
4    68.0
Name: salery, dtype: float64

In [44]:
# replace any specific values in an row
df["name"] = df["name"].replace("Alice","Deepak")

      name  salery      city  Promoted Salery
0   Deepak    65.0  New York           2065.0
1      Bob    70.0     Paris           2070.0
2  Charlie    75.0     Paris           2075.0
3    David    69.5    London              NaN
4      Eva    68.0      None           2068.0

In [52]:
# Dealing with duplicate values
# df_dup = df[df.duplicated()]
df_dup = df[df.duplicated(keep="last")]#it checks whether the entire row is a duplicate of a previous row.
df_dup

    name   age      city
0  Alice  25.0  New York

In [54]:
# Drop duplicate record
df = df.drop_duplicates()
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London

In [57]:
# Invalid values:
# lambda 
df['age'] = df['age'].apply(lambda x : x/10 if x > 20 else x)
df

      name  age      city
0    Alice  2.5  New York
1      Bob  3.0     Paris
2  Charlie  3.5     Paris
3    David  NaN    London

In [83]:
# String functions :

# df.drop("name", axis=1, inplace=True)
names = ["Deepak_Ghimire", "Shyam_Aryal", "John_Kyo", "HSH_dd"]

# creating new column adding values in it and reordering our columns
df["name"] = names
df = df[df.columns.sort_values()]
df = df[["name", "age", "city"]]

# split :
df[["first_name","last_name"]] = df["name"].str.split("_", expand=True)
df
df = df[["first_name","last_name", "age", "city"]]
df

  first_name last_name  age      city
0     Deepak   Ghimire  2.5  New York
1      Shyam     Aryal  3.0     Paris
2       John       Kyo  3.5     Paris
3        HSH        dd  NaN    London

In [109]:
# change data types:
df["age"] = df["age"].fillna(0).astype(int)

In [111]:
# multiply with function :
# def multiply(x):
#     return x * 2

# df["age"] = df["age"].apply(multiply)

# lambda :
# df["age"] = df["age"].apply(lambda x : x * 2)

      name  age      city
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35     Paris
3    David    0    London
4    Alice   25  New York

In [114]:
# Joins and merge :

# Joins -> left, right, outer, inner
# merge -> 

student1 = {
    "student_id": [101, 102, 103, 104, 105],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [20, 21, 19, 22, 20],
    "grade": ["A", "B", "A", "C", "B"]
}

dff = pd.DataFrame(student1)
dff

students2 = {
    "student_id": [101, 102, 103, 104, 105],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [20, 21, 19, 22, 20]
}

dfff = pd.DataFrame(students2)
dfff

   student_id     name  age
0         101    Alice   20
1         102      Bob   21
2         103  Charlie   19
3         104    David   22
4         105      Eva   20

In [125]:
# lets combine 

# concat :
# pd.concat([dff,dfff]) # stacked horizontally
pd.concat([dff,dfff], axis=1) # stacked vertically column wise


# Merge :
# pd.merge(dff.dfff, on = "age")

   student_id     name  age grade
0         101    Alice   20     A
1         102      Bob   21     B
2         103  Charlie   19     A
3         104    David   22     C
4         105      Eva   20     B

In [ ]:
# Importing file